---
title: WaterLoopData
classe: Autodesk.Revit.DB.Mechanical.WaterLoopData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# WaterLoopData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `WaterChillerType ChillerType { get; set; }` | `waterLoopData.ChillerType` | WaterChillerType |
| `ElementId CondenserWaterLoopId { get; set; }` | `waterLoopData.CondenserWaterLoopId` | ElementId |
| `Boolean IsValidObject { get; }` | `waterLoopData.IsValidObject` | Boolean |
| `WaterLoopType WaterLoopType { get; set; }` | `waterLoopData.WaterLoopType` | WaterLoopType |
| `Void Dispose()` | `waterLoopData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```